ci_app_1/app/Controllers/Myhome.php

    public function products()
    {
        $products = new ProductModel();
        $data['products'] = $products->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `products`
ORDER BY `id` DESC